# IS 362 Week 5 Project 2

# Data Set One

First step I will import Pandas and get started.Next step I will import my first csv from the discussion board. They provided a link to csv which contained a baseball card inventory. I will sort the data to show the three oldest cards, player name, brand, and what condition they are. This will be a good indicator of value.

In [18]:
import pandas as pd
cards = pd.read_csv ("C:/Users/johnj/IS 362 Spring 2018/Week 5 Project 2/cards.csv")
cardvalues = cards[['Player', 'Brand', 'Year', 'Condition']]
cardvalues.sort_values(by=["Year", "Condition"], ascending=True).head(3)

            Player  Brand  Year  Condition
64    George Brett  Topps  1987  EXCELLENT
193   George Brett  Topps  1988  EXCELLENT
195  Graig Nettles  Topps  1988  EXCELLENT

After performing this cleanup it seems that Neal has one card from 1987 and two from 1988. Two of the three cards are George Brett and one is Graig Nettles. All 3 cards are in excellent condition. It is safe to assume that these cards are Neal's most valuable cards.

# Data Set Two

The next data set that I used was from another post. This small data set seemed to rank actors and directors with Facebook likes. Despite this set being small there were some NaN values which would allow me to show how to exclude that data from my results.

First thing is to import the pandas and the data set:

In [19]:
import pandas as pd
webscrape = pd.read_csv ("C:/Users/johnj/IS 362 Spring 2018/Week 5 Project 2/webscrape.csv")

My next line of code will isolate the directors from the actors and drop any NaN values:

In [20]:
webscrape = webscrape[['director_name', 'num_critic_for_reviews', 'director_facebook_likes']].dropna()

My last line will show the full data set without any NaN values and ranked highest by amount of critic reviews.

In [21]:
webscrape.sort_values(by=["num_critic_for_reviews"], ascending=False).head()

       director_name  num_critic_for_reviews  director_facebook_likes
3  Christopher Nolan                   813.0                  22000.0
0      James Cameron                   723.0                      0.0
2         Sam Mendes                   602.0                      0.0
1     Gore Verbinski                   302.0                    563.0

Next the next sort I did with this data was similar to the first but I chose the actors to sort by this time and used their facebook likes to rank from highest to lowest. Any NaN data was removed and the full data set will be displayed.

In [22]:
import pandas as pd
webscrape = pd.read_csv ("C:/Users/johnj/IS 362 Spring 2018/Week 5 Project 2/webscrape.csv")
webscrape = webscrape[['actor_2_name', 'actor_1_facebook_likes']].dropna()
webscrape.sort_values(by=["actor_1_facebook_likes"], ascending=False).head()

       actor_2_name  actor_1_facebook_likes
1     Orlando Bloom                 40000.0
3    Christian Bale                 27000.0
2      Rory Kinnear                 11000.0
0  Joel David Moore                  1000.0
4        Rob Walker                   131.0

# Data Set Three

My last data set I chose was from a third post. This data set seems to be a crime statistic data set. There is a few ways to tidy up this data and it seems to have a good amount of information.

The first thing I noticed when examining this data set was that the first column was not named so I must give that column a name. I chose to name it States as that represents the data most accurately.

In [23]:
import pandas as pd
arrests = pd.read_csv ("C:/Users/johnj/IS 362 Spring 2018/Week 5 Project 2/USArrests.csv")
arrests.rename(columns={'Unnamed: 0':'States'}, inplace=True)

Now I can start to manipulate the data and display whatever I choose to. There was no NaN data in this set so we will not have to worry about that. I'll start with the Murder rate and display the top 5 states with the lowest murder rates.

In [24]:
arrests = arrests [['States', 'Murder']]
arrests.sort_values(by=["Murder"], ascending=True).head(5)

           States  Murder
33   North Dakota     0.8
28  New Hampshire     2.1
18          Maine     2.1
14           Iowa     2.2
44        Vermont     2.2

We can reverse how the data is dsiplayed and show the 5 states with the highest data rates as well.

In [25]:
arrests = arrests [['States', 'Murder']]
arrests.sort_values(by=["Murder"], ascending=False).head(5)

            States  Murder
9          Georgia    17.4
23     Mississippi    16.1
8          Florida    15.4
17       Louisiana    15.4
39  South Carolina    14.4

The next sort I did was to show states with the highest amount of assaults and thier urban population capita.

In [27]:
import pandas as pd
arrests = pd.read_csv ("C:/Users/johnj/IS 362 Spring 2018/Week 5 Project 2/USArrests.csv")
arrests.rename(columns={'Unnamed: 0':'States'}, inplace=True)
arrests = arrests [['States', 'Assault', 'UrbanPop']]
arrests.sort_values(by=["Assault"], ascending=False).head(5)

            States  Assault  UrbanPop
32  North Carolina      337        45
8          Florida      335        80
19        Maryland      300        67
2          Arizona      294        80
30      New Mexico      285        70

We can also show once again the opposite and show the states with the lowest rate.

In [28]:
arrests = arrests [['States', 'Assault', 'UrbanPop']]
arrests.sort_values(by=["Assault"], ascending=True).head(5)

          States  Assault  UrbanPop
33  North Dakota       45        44
10        Hawaii       46        83
44       Vermont       48        32
48     Wisconsin       53        66
14          Iowa       56        57

# Conclusion

Huge data sets can be maniuplated in many ways to just show critical select data. Values that are missing can be eliminated easily and reversing the data sets can be displayed with ease as well. Renaming columns to give a better description can also be used to help understand your results better.